import logging
from telegram import Update
from telegram.ext import ContextTypes

from core.db import save_user

logger = logging.getLogger(__name__)


async def start(update: Update, context: ContextTypes.DEFAULT_TYPE):
    user = update.effective_user
    save_user(user.id, user.first_name, user.last_name or '')
    start_text = "⚙️مرحبا بك في بوت التخفيض الخاص بالمتجر الصيني الشهير Aliexpress \n  \n ✅خصائص البوت:  \n ●توفير روابط عروض باسعار لاتجدها على الموقع \n ●له القدرة على جلب ست عروض مختلفة \n ●لذيه امكانية سحب ومعاينة السعر النهائي للمنتج \n ●يمكنه الحصول على نسبة التخفيض بالعملات وطبيعة الشحن \n ●يمكنه معرفة المنتج ان كان DDP ام لا (خاص بالاخوة المغاربة) \n ●امكانية الحصول على السعر بعملتي الدولار والدينار الجزائري \n ●معرفة عدد مبيعات المنتج وتقييمه بالاضافة الى تقييم المتجر \n  \n ✅طريقة استعمال البوت:  \n بطريقة بسيطة قم بنسخ رابط المنتج المراد شراؤه من موقع Aliexress من خلال رمز المشاركة الموجود في الاعلى (بالنسبة للتطبيق)، بعدها قم بلصق الرابط وارساله الى البوت، الان عليك النتظار ثواني قليلة ليقوم البوت بالتحضير والبحث عن العروض الممكنة، بعد حصولك على العروض اختر احسن سعر وقم باتمام عملية الشراء \n  \n ⛔ملاحظة: قم بتغيير الدولة في التطبيق (او الحساب)  إلى دولة كندا أو دولة اخرى أجنبية، مع ترك عنوان الشحن الخاص بك كما هو، وذالك للحصول على نسبة تخفيض أعلى في عرض العملات \n اي جديد تجدونه على قناتنا @rabahcopons"
    await update.message.reply_text(start_text)
